app/controllers/subdomain/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "account_id", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "last_name", "persistence_token", "login_count", "last_login_ip", "last_login_at", "first_name", "email") VALUES('HXM492A_fepc-HlhbsMJ', NULL, '2010-05-18 22:19:00', 'dfd522990be5f0544fa184920022ec129eeb3791dc43b13678230bc17ded10e72cfb0c29c2f4e90c466123e224aa3b27da9a15f4e798e614d5807e034727eaf9', 'U7xz96wsMDVrvkmh6DBP', '2010-05-18 22:19:00', 1, 0, NULL, 'ixbaxYRks4WlCHehXIKV', NULL, 'Rivers', 'd0d72a687f034e74a3098b992c0e7fc035d0b4f0934e2a2e08249406e329bf08f399cd38cb61be68ccd09a9da9484365dee33a8b71630768e17f04f5ccf097da', 0, NULL, NULL, 'Jone', 'jone@aol.com')
---
  def create
    @user = @account.users.build( params[:user] )
    @user.generate_one_time_password!
    if @user.save