app/controllers/subdomain/user_sessions_controller.rb

SELECT * FROM "users" WHERE (LOWER("users".email) = 'this.ryansmith@gmail.com') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      @account = User.find_by_email(@user_session.email).account