app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("created_at", "updated_at", "owner_id", "subdomain") VALUES('2010-04-10 21:35:27', '2010-04-10 21:35:27', NULL, 'wonderset')
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "account_id", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "last_name", "persistence_token", "login_count", "last_login_ip", "last_login_at", "first_name", "email") VALUES('eoEkRUtJp4hhS2XJcnvw', '2010-04-10 21:35:27', '2010-04-10 21:35:27', '0a174440323e70b30720c9411404252d9bfc383cf26125e5365791fef71aa1970c9e4fe5adddc4599cad86b3ee8a513e5befc44066a924f6b3cbd861fa692122', 'ESeGRlJ3J-Iy3WhyVU7V', '2010-04-10 21:35:27', 1, 0, '127.0.0.1', 'OTKjRMN6pw5eEf4bIRaV', '2010-04-10 21:35:27', NULL, '2455e9f674d0771a302d14e21e068a6a2cfe7236d16e6e669c14b75274afca4edb157d7df5c851f857a0cb3fbbfe67f8c3197a3b61a093609544873af0ba3ede', 1, NULL, NULL, NULL, 'this.ryansmith@gmail.com')
---
  def create
    @account = Account.new( params[:account] )
    respond_to do |wants|
      if @account.save and UserSession.create(@account.owner,true)