app/controllers/users_controller.rb

  def create
    @user = @account.users.build( params[:user] )
    @user.generate_one_time_password!
    if @user.save
---
INSERT INTO "accounts" ("created_at", "updated_at", "subdomain") VALUES('2010-02-22 05:25:10', '2010-02-22 05:25:10', NULL)
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('Qhtu6qQY-SlUM1b28Xyo', '2010-02-22 05:00:54', '2010-02-22 05:00:54', '2003cb4b1b551b728f38103cb8311dbee0715b199c304d9f5419410ae2acf8d4e9c92eb43cde41d1bcb0ac932d823188829f2b8d606ca57c390d3b83380f7669', 'eRPu4siS1uDUy1dmNUmH', '2010-02-22 05:00:54', 0, '127.0.0.1', 'NF0PGOaM2xGYFhCPBtqM', '2010-02-22 05:00:54', '9204e2952ca5a1596671ef0ee37df14e76be7e7b1a90f07122af70ea4f42c56160fe808ea2dc0c054bb3bc0bafab83a140cec98b8e2d9ad0de142956d4b4075f', 1, NULL, 'wonder set', NULL, 'this.ryansmith@gmail.com')