app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      user = @user_session.user
      @account = Account.find(user.account_id)
---
SELECT * FROM "users" WHERE (LOWER("users".email) = 'this.ryansmith@gmail.com') LIMIT 1